tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/fsl_clock.h
    /* LPSPI0304 */
    kCLOCK_LPSPI0304_ClockRoot_MuxOscRc24M    = 0U, /*!< LPSPI0304 mux from OscRc24M. */
    kCLOCK_LPSPI0304_ClockRoot_MuxOscRc400M   = 1U, /*!< LPSPI0304 mux from OscRc400M. */
    kCLOCK_LPSPI0304_ClockRoot_MuxSysPll3Pfd1 = 2U, /*!< LPSPI0304 mux from SysPll3Pfd1. */
    kCLOCK_LPSPI0304_ClockRoot_MuxSysPll2Out  = 3U, /*!< LPSPI0304 mux from SysPll2Out. */

    /* LPSPI0506 */
    kCLOCK_LPSPI0506_ClockRoot_MuxOscRc24M    = 0U, /*!< LPSPI0506 mux from OscRc24M. */
    kCLOCK_LPSPI0506_ClockRoot_MuxOscRc400M   = 1U, /*!< LPSPI0506 mux from OscRc400M. */
    kCLOCK_LPSPI0506_ClockRoot_MuxSysPll3Pfd1 = 2U, /*!< LPSPI0506 mux from SysPll3Pfd1. */
    kCLOCK_LPSPI0506_ClockRoot_MuxSysPll2Out  = 3U, /*!< LPSPI0506 mux from SysPll2Out. */

    /* I3C1 */
    kCLOCK_I3C1_ClockRoot_MuxOscRc24M    = 0U, /*!< I3C1 mux from OscRc24M. */
    kCLOCK_I3C1_ClockRoot_MuxOscRc400M   = 1U, /*!< I3C1 mux from OscRc400M. */
    kCLOCK_I3C1_ClockRoot_MuxSysPll3Div2 = 2U, /*!< I3C1 mux from SysPll3Div2. */
    kCLOCK_I3C1_ClockRoot_MuxSysPll2Pfd3 = 3U, /*!< I3C1 mux from SysPll2Pfd3. */

    /* I3C2 */
    kCLOCK_I3C2_ClockRoot_MuxOscRc24M    = 0U, /*!< I3C2 mux from OscRc24M. */
    kCLOCK_I3C2_ClockRoot_MuxOscRc400M   = 1U, /*!< I3C2 mux from OscRc400M. */
    kCLOCK_I3C2_ClockRoot_MuxSysPll3Div2 = 2U, /*!< I3C2 mux from SysPll3Div2. */
    kCLOCK_I3C2_ClockRoot_MuxSysPll2Pfd3 = 3U, /*!< I3C2 mux from SysPll2Pfd3. */

    /* USDHC1 */
    kCLOCK_USDHC1_ClockRoot_MuxOscRc24M    = 0U, /*!< USDHC1 mux from OscRc24M. */
    kCLOCK_USDHC1_ClockRoot_MuxOscRc400M   = 1U, /*!< USDHC1 mux from OscRc400M. */
    kCLOCK_USDHC1_ClockRoot_MuxSysPll2Pfd2 = 2U, /*!< USDHC1 mux from SysPll2Pfd2. */
    kCLOCK_USDHC1_ClockRoot_MuxSysPll1Div5 = 3U, /*!< USDHC1 mux from SysPll1Div5. */

    /* USDHC2 */
    kCLOCK_USDHC2_ClockRoot_MuxOscRc24M    = 0U, /*!< USDHC2 mux from OscRc24M. */
    kCLOCK_USDHC2_ClockRoot_MuxOscRc400M   = 1U, /*!< USDHC2 mux from OscRc400M. */
    kCLOCK_USDHC2_ClockRoot_MuxSysPll2Pfd2 = 2U, /*!< USDHC2 mux from SysPll2Pfd2. */
    kCLOCK_USDHC2_ClockRoot_MuxSysPll1Div5 = 3U, /*!< USDHC2 mux from SysPll1Div5. */

    /* SEMC */
    kCLOCK_SEMC_ClockRoot_MuxOscRc24M    = 0U, /*!< SEMC mux from OscRc24M. */
    kCLOCK_SEMC_ClockRoot_MuxOscRc400M   = 1U, /*!< SEMC mux from OscRc400M. */
    kCLOCK_SEMC_ClockRoot_MuxSysPll1Out  = 2U, /*!< SEMC mux from SysPll1Out. */
    kCLOCK_SEMC_ClockRoot_MuxSysPll2Pfd0 = 3U, /*!< SEMC mux from SysPll2Pfd0. */

    /* ADC1 */
    kCLOCK_ADC1_ClockRoot_MuxOscRc24M    = 0U, /*!< ADC1 mux from OscRc24M. */
    kCLOCK_ADC1_ClockRoot_MuxOscRc400M   = 1U, /*!< ADC1 mux from OscRc400M. */
    kCLOCK_ADC1_ClockRoot_MuxSysPll3Div2 = 2U, /*!< ADC1 mux from SysPll3Div2. */
    kCLOCK_ADC1_ClockRoot_MuxSysPll2Pfd3 = 3U, /*!< ADC1 mux from SysPll2Pfd3. */

    /* ADC2 */
    kCLOCK_ADC2_ClockRoot_MuxOscRc24M    = 0U, /*!< ADC2 mux from OscRc24M. */
    kCLOCK_ADC2_ClockRoot_MuxOscRc400M   = 1U, /*!< ADC2 mux from OscRc400M. */
    kCLOCK_ADC2_ClockRoot_MuxSysPll3Div2 = 2U, /*!< ADC2 mux from SysPll3Div2. */
    kCLOCK_ADC2_ClockRoot_MuxSysPll2Pfd3 = 3U, /*!< ADC2 mux from SysPll2Pfd3. */

    /* ACMP */
    kCLOCK_ACMP_ClockRoot_MuxOscRc24M    = 0U, /*!< ACMP mux from OscRc24M. */
    kCLOCK_ACMP_ClockRoot_MuxOscRc400M   = 1U, /*!< ACMP mux from OscRc400M. */
    kCLOCK_ACMP_ClockRoot_MuxSysPll3Out  = 2U, /*!< ACMP mux from SysPll3Out. */
    kCLOCK_ACMP_ClockRoot_MuxSysPll2Pfd3 = 3U, /*!< ACMP mux from SysPll2Pfd3. */

    /* ECAT */
    kCLOCK_ECAT_ClockRoot_MuxOscRc24M    = 0U, /*!< ECAT mux from OscRc24M. */
    kCLOCK_ECAT_ClockRoot_MuxOscRc400M   = 1U, /*!< ECAT mux from OscRc400M. */
    kCLOCK_ECAT_ClockRoot_MuxSysPll1Div2 = 2U, /*!< ECAT mux from SysPll1Div2. */
    kCLOCK_ECAT_ClockRoot_MuxSysPll1Div5 = 3U, /*!< ECAT mux from SysPll1Div5. */

    /* ENET */
    kCLOCK_ENET_ClockRoot_MuxOscRc24M    = 0U, /*!< ENET mux from OscRc24M. */
    kCLOCK_ENET_ClockRoot_MuxOscRc400M   = 1U, /*!< ENET mux from OscRc400M. */
    kCLOCK_ENET_ClockRoot_MuxSysPll1Div2 = 2U, /*!< ENET mux from SysPll1Div2. */
    kCLOCK_ENET_ClockRoot_MuxSysPll1Div5 = 3U, /*!< ENET mux from SysPll1Div5. */

    /* TMR_1588 */
    kCLOCK_TMR_1588_ClockRoot_MuxOscRc24M    = 0U, /*!< TMR_1588 mux from OscRc24M. */
    kCLOCK_TMR_1588_ClockRoot_MuxOscRc400M   = 1U, /*!< TMR_1588 mux from OscRc400M. */
    kCLOCK_TMR_1588_ClockRoot_MuxSysPll3Out  = 2U, /*!< TMR_1588 mux from SysPll3Out. */
    kCLOCK_TMR_1588_ClockRoot_MuxSysPll2Pfd3 = 3U, /*!< TMR_1588 mux from SysPll2Pfd3. */

    /* NETC */
    kCLOCK_NETC_ClockRoot_MuxOscRc24M    = 0U, /*!< NETC mux from OscRc24M. */
    kCLOCK_NETC_ClockRoot_MuxOscRc400M   = 1U, /*!< NETC mux from OscRc400M. */
    kCLOCK_NETC_ClockRoot_MuxSysPll3Pfd3 = 2U, /*!< NETC mux from SysPll3Pfd3. */
    kCLOCK_NETC_ClockRoot_MuxSysPll2Pfd1 = 3U, /*!< NETC mux from SysPll2Pfd1. */

    /* MAC0 */
    kCLOCK_MAC0_ClockRoot_MuxOscRc24M    = 0U, /*!< MAC0 mux from OscRc24M. */
    kCLOCK_MAC0_ClockRoot_MuxOscRc400M   = 1U, /*!< MAC0 mux from OscRc400M. */
    kCLOCK_MAC0_ClockRoot_MuxSysPll1Div2 = 2U, /*!< MAC0 mux from SysPll1Div2. */
    kCLOCK_MAC0_ClockRoot_MuxSysPll1Div5 = 3U, /*!< MAC0 mux from SysPll1Div5. */

    /* MAC1 */
    kCLOCK_MAC1_ClockRoot_MuxOscRc24M    = 0U, /*!< MAC1 mux from OscRc24M. */
    kCLOCK_MAC1_ClockRoot_MuxOscRc400M   = 1U, /*!< MAC1 mux from OscRc400M. */
    kCLOCK_MAC1_ClockRoot_MuxSysPll1Div2 = 2U, /*!< MAC1 mux from SysPll1Div2. */
    kCLOCK_MAC1_ClockRoot_MuxSysPll1Div5 = 3U, /*!< MAC1 mux from SysPll1Div5. */

    /* MAC2 */
    kCLOCK_MAC2_ClockRoot_MuxOscRc24M    = 0U, /*!< MAC2 mux from OscRc24M. */
    kCLOCK_MAC2_ClockRoot_MuxOscRc400M   = 1U, /*!< MAC2 mux from OscRc400M. */
    kCLOCK_MAC2_ClockRoot_MuxSysPll1Div2 = 2U, /*!< MAC2 mux from SysPll1Div2. */
    kCLOCK_MAC2_ClockRoot_MuxSysPll1Div5 = 3U, /*!< MAC2 mux from SysPll1Div5. */

    /* MAC3 */
    kCLOCK_MAC3_ClockRoot_MuxOscRc24M    = 0U, /*!< MAC3 mux from OscRc24M. */
    kCLOCK_MAC3_ClockRoot_MuxOscRc400M   = 1U, /*!< MAC3 mux from OscRc400M. */
    kCLOCK_MAC3_ClockRoot_MuxSysPll1Div2 = 2U, /*!< MAC3 mux from SysPll1Div2. */
    kCLOCK_MAC3_ClockRoot_MuxSysPll1Div5 = 3U, /*!< MAC3 mux from SysPll1Div5. */

    /* MAC4 */
    kCLOCK_MAC4_ClockRoot_MuxOscRc24M    = 0U, /*!< MAC4 mux from OscRc24M. */
    kCLOCK_MAC4_ClockRoot_MuxOscRc400M   = 1U, /*!< MAC4 mux from OscRc400M. */
    kCLOCK_MAC4_ClockRoot_MuxSysPll1Div2 = 2U, /*!< MAC4 mux from SysPll1Div2. */
    kCLOCK_MAC4_ClockRoot_MuxSysPll1Div5 = 3U, /*!< MAC4 mux from SysPll1Div5. */

    /* SERDES0 */
    kCLOCK_SERDES0_ClockRoot_MuxOscRc24M    = 0U, /*!< SERDES0 mux from OscRc24M. */
    kCLOCK_SERDES0_ClockRoot_MuxOscRc400M   = 1U, /*!< SERDES0 mux from OscRc400M. */
    kCLOCK_SERDES0_ClockRoot_MuxSysPll1Div2 = 2U, /*!< SERDES0 mux from SysPll1Div2. */
    kCLOCK_SERDES0_ClockRoot_MuxSysPll1Div5 = 3U, /*!< SERDES0 mux from SysPll1Div5. */

    /* SERDES1 */
    kCLOCK_SERDES1_ClockRoot_MuxOscRc24M    = 0U, /*!< SERDES1 mux from OscRc24M. */
    kCLOCK_SERDES1_ClockRoot_MuxOscRc400M   = 1U, /*!< SERDES1 mux from OscRc400M. */
    kCLOCK_SERDES1_ClockRoot_MuxSysPll1Div2 = 2U, /*!< SERDES1 mux from SysPll1Div2. */
    kCLOCK_SERDES1_ClockRoot_MuxSysPll1Div5 = 3U, /*!< SERDES1 mux from SysPll1Div5. */

    /* SERDES2 */
    kCLOCK_SERDES2_ClockRoot_MuxOscRc24M    = 0U, /*!< SERDES2 mux from OscRc24M. */
    kCLOCK_SERDES2_ClockRoot_MuxOscRc400M   = 1U, /*!< SERDES2 mux from OscRc400M. */
    kCLOCK_SERDES2_ClockRoot_MuxSysPll1Div2 = 2U, /*!< SERDES2 mux from SysPll1Div2. */
    kCLOCK_SERDES2_ClockRoot_MuxSysPll1Div5 = 3U, /*!< SERDES2 mux from SysPll1Div5. */

